<div class="user__chat-text">
  <div class="user__chat-text-return">
    <svg width="18" height="16" viewBox="0 0 18 16" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path d="M17.2074 7.95591C17.2054 7.5932 17.0593 7.24616 16.8014 6.99113C16.5435 6.7361 16.1948 6.59397 15.8321 6.59602L5.0007 6.65703L8.57269 3.04457C8.8128 2.78396 8.94239 2.44032 8.93414 2.08605C8.92589 1.73179 8.78046 1.39455 8.52848 1.14539C8.2765 0.896238 7.93765 0.754612 7.58331 0.750357C7.22897 0.746101 6.88682 0.879549 6.62893 1.12258L0.736046 7.08223C0.481383 7.3401 0.339489 7.68851 0.341531 8.05093C0.343572 8.41334 0.489383 8.76013 0.746934 9.01511L6.70659 14.908C6.83255 15.0417 6.98414 15.1486 7.15232 15.2224C7.3205 15.2962 7.50182 15.3353 7.68546 15.3376C7.86911 15.3398 8.05132 15.305 8.22122 15.2352C8.39113 15.1655 8.54524 15.0622 8.67437 14.9316C8.80351 14.801 8.90501 14.6458 8.97284 14.4751C9.04066 14.3044 9.07341 14.1218 9.06914 13.9382C9.06486 13.7546 9.02365 13.5737 8.94796 13.4064C8.87227 13.2391 8.76364 13.0887 8.62857 12.9642L5.01611 9.39223L15.8475 9.33122C16.6024 9.32696 17.2116 8.71083 17.2074 7.95591Z" fill="#4E6796" />
    </svg>
  </div>
  <div class="user__chat-text-title">ORDER #28012024-3</div>
  <div class="user__chat-text-subtitle">инфо о машине, о пользователе, опции отключения</div>
</div>
<div class="user__chat-content">
  <div class="user__chat-messages" id="chat-messages">
    <div class="user__chat-message _date">May 31</div>
    <div class="user__chat-message">
      <div class="user__chat-message-text">
        <p>инфо о машине, о пользователе, опции отключения инфо о машине, о пользователе, опции отключения инфо о машине инфо о машине, о пользователе, опции отключения инфо о</p>
      </div>
      <div class="user__chat-meta">
        <div class="user__chat-meta-time">18:32</div>
        <div class="user__chat-meta-status _read"></div>
      </div>
    </div>
    <div class="user__chat-message _left">
      <div class="user__chat-message-text">
        <p>инфо о машине, о пользователе, опции отключения инфо о машине, о пользователе, опции отключения инфо о машине инфо о машине, о пользователе, опции отключения инфо о</p>
      </div>
      <div class="user__chat-meta">
        <div class="user__chat-meta-time">19:32</div>
        <div class="user__chat-meta-status _read"></div>
      </div>
    </div>
    <div class="user__chat-message">
      <div class="user__chat-message-text">
        <p>инфо о машине, о пользователе, опции отключения инфо о машине, о пользователе, опции отключения инфо о машине</p><img width="254" height="100" src="/images/user/tickets/car.jpg" alt="">
      </div>
      <div class="user__chat-meta">
        <div class="user__chat-meta-time">20:32</div>
        <div class="user__chat-meta-status _unread"></div>
      </div>
    </div>
  </div>
</div>
<form
  class="user__chat-bottom"
  data-action-file="/php/file-upload.php"
  id="chat-form"
  onsubmit="event.preventDefault(); return sendMessage(this)"
  enctype="multipart/form-data">

  <div class="user__chat-fields">
    <label class="user__chat-file" for="user__chat-file">
      <input type="file" name="files" multiple id="user__chat-file" /><svg width="20" height="22" viewBox="0 0 20 22" fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <path fill-rule="evenodd" clip-rule="evenodd"
          d="M16.9711 2.65914C16.7622 2.45021 16.5142 2.28447 16.2412 2.17139C15.9682 2.05832 15.6756 2.00012 15.3801 2.00012C15.0847 2.00012 14.7921 2.05832 14.5191 2.17139C14.2461 2.28447 13.9981 2.45021 13.7891 2.65914L2.84915 13.5991C2.14592 14.3025 1.75091 15.2564 1.751 16.251C1.7511 17.2456 2.14629 18.1994 2.84965 18.9026C3.553 19.6059 4.5069 20.0009 5.5015 20.0008C6.4961 20.0007 7.44992 19.6055 8.15315 18.9021L15.8461 11.2091C15.9883 11.0767 16.1764 11.0045 16.3707 11.008C16.565 11.0114 16.7504 11.0901 16.8878 11.2275C17.0252 11.3649 17.1039 11.5503 17.1073 11.7446C17.1107 11.9389 17.0386 12.127 16.9061 12.2691L9.21315 19.9621C8.728 20.46 8.1488 20.8566 7.50918 21.1288C6.86955 21.4011 6.18222 21.5436 5.48708 21.5481C4.79194 21.5525 4.10283 21.4189 3.45973 21.155C2.81664 20.8911 2.23236 20.502 1.74081 20.0105C1.24927 19.5189 0.860231 18.9347 0.596285 18.2916C0.33234 17.6485 0.198739 16.9593 0.203235 16.2642C0.207731 15.5691 0.350235 14.8817 0.622477 14.2421C0.89472 13.6025 1.29128 13.0233 1.78915 12.5381L12.7281 1.59814C13.4315 0.894919 14.3854 0.499906 15.38 0.5C16.3746 0.500094 17.3284 0.895287 18.0316 1.59864C18.7349 2.30199 19.1299 3.2559 19.1298 4.25049C19.1297 5.24509 18.7345 6.19892 18.0311 6.90214L7.09815 17.8351L7.09015 17.8431L7.08315 17.8501L7.08115 17.8521L7.07815 17.8541C6.65051 18.2533 6.08423 18.4702 5.49937 18.4589C4.91451 18.4475 4.35705 18.2089 3.94518 17.7935C3.5333 17.3781 3.29939 16.8187 3.29304 16.2337C3.28669 15.6488 3.50839 15.0844 3.91115 14.6601L11.7211 6.85014C11.8625 6.71345 12.0519 6.63777 12.2486 6.63938C12.4452 6.641 12.6334 6.71979 12.7725 6.85878C12.9116 6.99777 12.9906 7.18584 12.9924 7.38249C12.9942 7.57914 12.9187 7.76862 12.7821 7.91014L4.97215 15.7201C4.83052 15.8599 4.75022 16.0502 4.74891 16.2492C4.74759 16.4482 4.82538 16.6395 4.96515 16.7811C5.10492 16.9228 5.29522 17.0031 5.4942 17.0044C5.69317 17.0057 5.88452 16.9279 6.02615 16.7881L16.9711 5.84014C17.1801 5.63121 17.3458 5.38317 17.4589 5.11018C17.572 4.8372 17.6302 4.54462 17.6302 4.24914C17.6302 3.95366 17.572 3.66108 17.4589 3.3881C17.3458 3.11511 17.1801 2.86807 16.9711 2.65914Z"
          fill="#F56E0F"></path>
      </svg>
    </label>
    <input type="hidden" name="ticket_id" value="1" />
    <input class="user__chat-input" type="text" name="message" placeholder="Write your message..." />
    <button class="user__chat-send" type="submit">
      <svg width="18" height="16" viewBox="0 0 18 16" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path
          d="M1.4 15.4246C1.06667 15.558 0.75 15.5286 0.45 15.3366C0.15 15.1446 0 14.8656 0 14.4996V9.99965L8 7.99965L0 5.99965V1.49965C0 1.13298 0.15 0.853981 0.45 0.662648C0.75 0.471314 1.06667 0.441981 1.4 0.574647L16.8 7.07465C17.2167 7.25798 17.425 7.56631 17.425 7.99965C17.425 8.43298 17.2167 8.74131 16.8 8.92465L1.4 15.4246Z"
          fill="#F5F5F5"></path>
      </svg>
    </button>
  </div>
</form>
<script>
  initEventFiles();
</script>
